 ## Scope
 * split-apply-combine in detail
 * groupby() mechanics and lazy evaluation
 * aggregation funcation
 * grouping by multiple keys
 * groupby() +transformation(),filter, and apply()

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'1.4.3'

In [3]:
# datasource:'https://andybek.com/pandas-games'

In [4]:
game_sales=pd.read_csv('https://andybek.com/pandas-games')

In [5]:
game_sales.head()

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,Kinect Adventures!,X360,2010.0,Misc,Microsoft Game Studios,14.97,4.94,0.24,1.67,21.82
1,Grand Theft Auto V,PS3,2013.0,Action,Take-Two Interactive,7.01,9.27,0.97,4.14,21.40
2,Grand Theft Auto V,X360,2013.0,Action,Take-Two Interactive,9.63,5.31,0.06,1.38,16.38
3,Call of Duty: Modern Warfare 3,X360,2011.0,Shooter,Activision,9.03,4.28,0.13,1.32,14.76
4,Call of Duty: Black Ops,X360,2010.0,Shooter,Activision,9.67,3.73,0.11,1.13,14.64

In [6]:
game_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3143 entries, 0 to 3142
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          3143 non-null   object
 1   Platform      3143 non-null   object
 2   Year          3088 non-null   float64
 3   Genre         3143 non-null   object
 4   Publisher     3136 non-null   object
 5   NA_Sales      3143 non-null   float64
 6   EU_Sales      3143 non-null   float64
 7   JP_Sales      3143 non-null   float64
 8   Other_Sales   3143 non-null   float64
 9   Global_Sales  3143 non-null   float64
dtypes: float64(6), object(4)
memory usage: 245.7+ KB

### Simple aggrigation

In [7]:
#total sales across all the reasons
#Here we need all the rows but columns with sales only, so select those data only
game_sales.loc[:,['NA_Sales','EU_Sales','JP_Sales','Other_Sales']].sum()

NA_Sales       1173.30
EU_Sales        793.64
JP_Sales        107.06
Other_Sales     282.75
dtype: float64

In [17]:
game_sales.loc[:,['NA_Sales','EU_Sales','JP_Sales','Other_Sales']].max()

NA_Sales       14.97
EU_Sales        9.27
JP_Sales        1.87
Other_Sales     4.14
dtype: float64

### Conditional aggrigation

In [9]:
game_sales.Platform.unique()

array(['X360', 'PS3', 'PS4', 'XOne'], dtype=object)

In [10]:
#Objective : find total sales by region for X360 and PS3

In [11]:
sales=game_sales.loc[:,['Platform','NA_Sales','EU_Sales','JP_Sales','Other_Sales']]

In [12]:
#find sum only for numberic data not to the string
sales.sum(numeric_only=True)

NA_Sales       1173.30
EU_Sales        793.64
JP_Sales        107.06
Other_Sales     282.75
dtype: float64

In [13]:
sales

     Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales
0        X360     14.97      4.94      0.24         1.67
1         PS3      7.01      9.27      0.97         4.14
2        X360      9.63      5.31      0.06         1.38
3        X360      9.03      4.28      0.13         1.32
4        X360      9.67      3.73      0.11         1.13
...       ...       ...       ...       ...          ...
3138     X360      0.00      0.01      0.00         0.00
3139     XOne      0.01      0.00      0.00         0.00
3140     XOne      0.01      0.00      0.00         0.00
3141      PS4      0.00      0.01      0.00         0.00
3142     XOne      0.00      0.01      0.00         0.00

[3143 rows x 5 columns]

In [14]:
sales.loc[sales.Platform=='X360'].sum(numeric_only=True)

NA_Sales       601.05
EU_Sales       280.58
JP_Sales        12.43
Other_Sales     85.54
dtype: float64

### Split, apply and combine

In [25]:
sales.loc[]

Platform        PS3
NA_Sales       7.01
EU_Sales       9.27
JP_Sales       0.97
Other_Sales    4.14
Name: 1, dtype: object

In [26]:
#split
sales.loc[sales.Platform=='X360'].sum(numeric_only=True)
sales.loc[sales.Platform=='PS3'].sum(numeric_only=True)

NA_Sales       392.26
EU_Sales       343.71
JP_Sales        79.99
Other_Sales    141.93
dtype: float64

### Group by method

In [27]:
sales

     Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales
0        X360     14.97      4.94      0.24         1.67
1         PS3      7.01      9.27      0.97         4.14
2        X360      9.63      5.31      0.06         1.38
3        X360      9.03      4.28      0.13         1.32
4        X360      9.67      3.73      0.11         1.13
...       ...       ...       ...       ...          ...
3138     X360      0.00      0.01      0.00         0.00
3139     XOne      0.01      0.00      0.00         0.00
3140     XOne      0.01      0.00      0.00         0.00
3141      PS4      0.00      0.01      0.00         0.00
3142     XOne      0.00      0.01      0.00         0.00

[3143 rows x 5 columns]

In [29]:
sales.groupby('Platform').sum()

          NA_Sales  EU_Sales  JP_Sales  Other_Sales
Platform
PS3         392.26    343.71     79.99       141.93
PS4          96.80    123.70     14.30        43.36
X360        601.05    280.58     12.43        85.54
XOne         83.19     45.65      0.34        11.92

In [31]:
#what is the avegafe sales by platform on each reason
sales.groupby('Platform').mean()

          NA_Sales  EU_Sales  JP_Sales  Other_Sales
Platform
PS3       0.295154  0.258623  0.060188     0.106795
PS4       0.288095  0.368155  0.042560     0.129048
X360      0.475138  0.221802  0.009826     0.067621
XOne      0.390563  0.214319  0.001596     0.055962

In [33]:
sales.groupby('Platform').median()

          NA_Sales  EU_Sales  JP_Sales  Other_Sales
Platform
PS3           0.12      0.07      0.01         0.03
PS4           0.07      0.08      0.02         0.03
X360          0.17      0.06      0.00         0.02
XOne          0.15      0.07      0.00         0.02

In [34]:
 sales["Platform"]

0       X360
1        PS3
2       X360
3       X360
4       X360
        ...
3138    X360
3139    XOne
3140    XOne
3141     PS4
3142    XOne
Name: Platform, Length: 3143, dtype: object

### Customizng index to group Mapping

In [35]:
platform_name={
    'PS3':'playstation',
    'PS4':'playstation',
    'x360':'XBox',
    'XOne': 'XBox'
}

In [38]:
sales.set_index('Platform').groupby(platform_name).sum()

             NA_Sales  EU_Sales  JP_Sales  Other_Sales
Platform
XBox            83.19     45.65      0.34        11.92
playstation    489.06    467.41     94.29       185.29

In [46]:
#Squeeze function returns a series
game_ser=game_sales.loc[:,['Genre','Global_Sales']].set_index('Genre').squeeze()

In [51]:
game_ser.groupby('Genre').mean().sort_values(ascending=False)

Genre
Shooter         1.412019
Action          0.751007
Role-Playing    0.715804
Racing          0.687854
Sports          0.681094
Platform        0.651842
Fighting        0.604182
Misc            0.550250
Simulation      0.336076
Adventure       0.298289
Strategy        0.264333
Puzzle          0.133636
Name: Global_Sales, dtype: float64

In [ ]:
### Problem channalge
* Create a smaller dataframe froma games_sales selecting only publisher,Genre, Platform, and NA_sales columns